pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/rx_mcu.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2014(2015) Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name    : rx_rsk.c
* Description  : RX MCU processing
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version Description
*         : 04.01.2014 1.00 First Release
*         : 30.01.2015 1.01    Added RX71M.
***********************************************************************************************************************/


/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
#include <machine.h>
#include "r_usb_basic_if.h"

#ifdef USB_DTC_ENABLE
#include "r_dtc_rx_if.h"
#endif /* USB_DTC_ENABLE */


/******************************************************************************
Constant macro definitions
******************************************************************************/
/* Select Use IP */
#define USB_PswIntDisable               (uint32_t)(7 << 24) /* Processer Status Word - IPL(Level7) */
#define USB_PswIntSleep                 (uint32_t)(1 << 24) /* Processer Status Word - IPL(Level1) */

/******************************************************************************
External variables and functions
******************************************************************************/
extern void     R_usb_pstd_DeviceInformation(USB_UTR_t *ptr, uint16_t *tbl);

/******************************************************************************
Typedef definitions
******************************************************************************/


/******************************************************************************
Private global variables and functions
******************************************************************************/
#ifdef USB_DTC_ENABLE
dtc_transfer_data_cfg_t    usb_td_cfg[2];
dtc_transfer_data_t        usb_dtc_transfer_data[2];
#endif  /* USB_DTC_ENABLE */


/******************************************************************************
Private global variables and functions
******************************************************************************/
uint16_t usb_gcstd_D0fifo[2u] = {0,0};      /* D0fifo0 Interrupt Request enable */
uint16_t usb_gcstd_D1fifo[2u] = {0,0};      /* D1fifo0 Interrupt Request enable */

static bool usb_gstd_is_opened[2] = { false, false };

/*=== SYSTEM ================================================================*/
usb_err_t   usb_cpu_module_start( usb_ip_t ip_type );
usb_err_t   usb_cpu_module_stop( usb_ip_t ip_type );
void        usb_cpu_target_init(void);
/*=== Interrupt =============================================================*/
void        usb_cpu_usbint_init(void);
void        usb_cpu_usb_int_hand(void);
void        usb2_cpu_usb_int_hand(void);
void        usb_cpu_d0fifo_int_hand(void);
void        usb2_cpu_d0fifo_int_hand(void);
void        usb_cpu_int_enable(USB_UTR_t *ptr);
void        usb_cpu_int_disable(USB_UTR_t *ptr);
/*=== TIMER =================================================================*/
void        usb_cpu_Delay1us(uint16_t time);
void        usb_cpu_DelayXms(uint16_t time);

#ifdef USB_DTC_ENABLE
/*=== DMA ===================================================================*/
void        usb_cpu_d0fifo2buf_start_dma(USB_UTR_t *ptr, uint32_t SourceAddr);
void        usb_cpu_buf2d0fifo_start_dma(USB_UTR_t *ptr, uint32_t DistAdr);
void        usb_cpu_d0fifo_restart_dma(USB_UTR_t *ptr);
void        usb_cpu_d0fifo_stop_dma(USB_UTR_t *ptr);
uint16_t    usb_cpu_get_dtc_block_count(USB_UTR_t *ptr);
void        usb_cpu_d0fifo_enable_dma(USB_UTR_t *ptr );
void        usb_cpu_d0fifo_disable_dma(USB_UTR_t *ptr );
#endif  /* USB_DTC_ENABLE */


#pragma interrupt usb_cpu_usb_int_hand(vect = VECT(USB0, USBI0))
#pragma interrupt usb2_cpu_usb_int_hand(vect = VECT(USBA, USBAR))
#pragma interrupt usb_cpu_d0fifo_int_hand(vect = VECT(USB0, D0FIFO0))
#pragma interrupt usb2_cpu_d0fifo_int_hand(vect = VECT(USBA, D0FIFO2))

/******************************************************************************
Renesas Abstracted RSK functions
******************************************************************************/


