pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/rx_mcu.c
/******************************************************************************
Function Name   : usb_cpu_module_start
Description     : USB module start
Arguments       : usb_ip_t ip_type  : USB_IP0/USB_IP1
Return value    : none
******************************************************************************/
usb_err_t usb_cpu_module_start( usb_ip_t ip_type )
{
    if( USB_IP0 == ip_type )
    {
        if(R_BSP_HardwareLock(BSP_LOCK_USB0) == false)
        {
            /* Lock has already been acquired by another task. Need to try again later */
            return USB_ERR_BUSY;
        }
        if(usb_gstd_is_opened[ip_type] == true)
        {
            R_BSP_HardwareUnlock(BSP_LOCK_USB0);
            return USB_ERR_OPENED;
        }

        /* Enable writing to MSTP registers */
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
        /* Enable power for USB0 */
        SYSTEM.MSTPCRB.BIT.MSTPB19 = 0u;
        /* Disable writing to MSTP registers */
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

        R_BSP_HardwareUnlock(BSP_LOCK_USB0);
    }
    else if( USB_IP1 == ip_type )
    {
        if(R_BSP_HardwareLock(BSP_LOCK_USBA) == false)
        {
            /* Lock has already been acquired by another task. Need to try again later */
            return USB_ERR_BUSY;
        }
        if(usb_gstd_is_opened[ip_type] == true)
        {
            R_BSP_HardwareUnlock(BSP_LOCK_USBA);
            return USB_ERR_OPENED;
        }

        /* Enable writing to MSTP registers */
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
        /* Enable power for USBA */
        SYSTEM.MSTPCRB.BIT.MSTPB12 = 0u;
        /* Disable writing to MSTP registers */
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

        R_BSP_HardwareUnlock(BSP_LOCK_USBA);
    }
    else
    {
    }

    usb_gstd_is_opened[ip_type] = true;

    return USB_SUCCESS;
}
/******************************************************************************
End of function usb_cpu_McuInitialize
******************************************************************************/

/******************************************************************************
Function Name   : usb_cpu_module_stop
Description     : USB module stop
Arguments       : usb_ip_t ip_type  : USB_IP0/USB_IP1
Return value    : none
******************************************************************************/
usb_err_t usb_cpu_module_stop( usb_ip_t ip_type )
{
    if( USB_IP0 == ip_type )
    {
        if(R_BSP_HardwareLock(BSP_LOCK_USB0) == false)
        {
            /* Lock has already been acquired by another task. Need to try again later */
            return USB_ERR_BUSY;
        }
        if(usb_gstd_is_opened[ip_type] == false)
        {
            R_BSP_HardwareUnlock(BSP_LOCK_USB0);
            return USB_ERR_NOT_OPEN;
        }

        /* Enable writing to MSTP registers */
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
        /* Disable power for USB0 */
        SYSTEM.MSTPCRB.BIT.MSTPB19 = 1u;
        /* Disable writing to MSTP registers */
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

        R_BSP_HardwareUnlock(BSP_LOCK_USB0);
    }
    else if( USB_IP1 == ip_type )
    {
        if(R_BSP_HardwareLock(BSP_LOCK_USBA) == false)
        {
            /* Lock has already been acquired by another task. Need to try again later */
            return USB_ERR_BUSY;
        }
        if(usb_gstd_is_opened[ip_type] == false)
        {
            R_BSP_HardwareUnlock(BSP_LOCK_USBA);
            return USB_ERR_NOT_OPEN;
        }

        /* Enable writing to MSTP registers */
        R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);
        /* Disable power for USBA */
        SYSTEM.MSTPCRB.BIT.MSTPB12 = 1u;
        /* Disable writing to MSTP registers */
        R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);

        R_BSP_HardwareUnlock(BSP_LOCK_USBA);
    }
    else
    {
    }

    usb_gstd_is_opened[ip_type] = false;

    return USB_SUCCESS;
}
/******************************************************************************
End of function usb_cpu_McuInitialize
******************************************************************************/

/******************************************************************************
Function Name   : usb_cpu_target_init
Description     : Target System Initialize
Arguments       : none
Return value    : none
******************************************************************************/
void usb_cpu_target_init( void )
{
    /* Enable Interrupt */
    usb_cpu_usbint_init();      /* Initialized USB interrupt  */
}
/******************************************************************************
End of function usb_cpu_target_init
******************************************************************************/

/******************************************************************************
Interrupt function
******************************************************************************/
/******************************************************************************
Function Name   : usb_cpu_usbint_init
Description     : USB interrupt Initialize
Arguments       : void
Return value    : void
******************************************************************************/
void usb_cpu_usbint_init( void )
{
/* Condition compilation by the difference of USB function */
#if USB_FUNCSEL_USBIP0_PP != USB_NOUSE_PP
    /* Deep standby USB monitor register
    b0      SRPC0    USB0 single end control
    b3-b1   Reserved 0
    b4      FIXPHY0  USB0 transceiver output fix
    b7-b5   Reserved 0
    b8      SRPC1    USB1 single end control
    b11-b9  Reserved 0
    b12     FIXPHY1  USB1 transceiver output fix
    b15-b13 Reserved 0
    b16     DP0      USB0 DP input
    b17     DM0      USB0 DM input
    b19-b18 Reserved 0
    b20     DOVCA0   USB0 OVRCURA input
    b21     DOVCB0   USB0 OVRCURB input
    b22     Reserved 0
    b23     DVBSTS0  USB1 VBUS input
    b24     DP1      USB1 DP input
    b25     DM1      USB1 DM input
    b27-b26 Reserved 0
    b28     DOVCA1   USB1 OVRCURA input
    b29     DOVCB1   USB1 OVRCURB input
    b30     Reserved 0
    b31     DVBSTS1  USB1 VBUS input
    */
    USB.DPUSR0R.BIT.FIXPHY0 = 0u;   /* USB0 Transceiver Output fixed */

    /* Interrupt enable register
    b0 IEN0 Interrupt enable bit
    b1 IEN1 Interrupt enable bit
    b2 IEN2 Interrupt enable bit
    b3 IEN3 Interrupt enable bit
    b4 IEN4 Interrupt enable bit
    b5 IEN5 Interrupt enable bit
    b6 IEN6 Interrupt enable bit
    b7 IEN7 Interrupt enable bit
    */
    IEN( USB0, D0FIFO0 ) = 0u;    /* D0FIFO0 disable */
    IEN( USB0, D1FIFO0 ) = 0u;    /* D1FIFO0 disable */
    IEN( USB0, USBR0 )   = 1u;    /* USBR0 enable */

    /* Interrupt priority register
    b3-b0 IPR      Interrupt priority
    b7-b4 Reserved 0
    */
    IPR( USB0, D0FIFO0 ) = 0x00;  /* D0FIFO0 */
    IPR( USB0, D1FIFO0 ) = 0x00;  /* D1FIFO0 */
    IPR( USB0, USBR0 )   = 0x00;  /* USBR0 */

    IPR( USB0, USBI0 )   = 0x03;  /* USBI0 in vector 128 */
    IEN( USB0, USBI0 )   = 1u;    /* USBI0 enable in vector 128 */
#endif  /* USB_FUNCSEL_USBIP0_PP != USB_NOUSE_PP */

#if USB_FUNCSEL_USBIP1_PP != USB_NOUSE_PP
    /* Interrupt enable register
    b0 IEN0 Interrupt enable bit
    b1 IEN1 Interrupt enable bit
    b2 IEN2 Interrupt enable bit
    b3 IEN3 Interrupt enable bit
    b4 IEN4 Interrupt enable bit
    b5 IEN5 Interrupt enable bit
    b6 IEN6 Interrupt enable bit
    b7 IEN7 Interrupt enable bit
    */
    IEN( USBA, D0FIFO2 ) = 0u;   /* Disable D0FIF2 interrupt */
    IEN( USBA, D1FIFO2 ) = 0u;   /* Disable D1FIF2 interrupt */
    IEN( USBA, USBAR )   = 1u;   /* Enable  USBA  interrupt */

