pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/rx_mcu.c
    /* Priority D0FIFO0=0(Disable)
    b3-b0 IPR      Interrupt priority
    b7-b4 Reserved 0
    */
    IPR( USBA, D0FIFO2 ) = 0x00; /* D0FIFO2 */
    IPR( USBA, D1FIFO2 ) = 0x00; /* D0FIFO2 */
    IPR( USBA, USBAR )   = 0x03; /* USBA */
#endif  /* USB_FUNCSEL_USBIP1_PP != USB_NOUSE_PP */
}
/******************************************************************************
End of function usb_cpu_usbint_init
******************************************************************************/


/******************************************************************************
Function Name   : usb_cpu_usb_int_hand
Description     : USB interrupt Handler
Arguments       : void
Return value    : void
******************************************************************************/
void usb_cpu_usb_int_hand(void)
{
/* Condition compilation by the difference of USB function */
#if USB_FUNCSEL_USBIP0_PP != USB_NOUSE_PP
    /* Call USB interrupt routine */
    usb_cstd_UsbHandler();      /* Call interrupt routine */

    ICU.PIBR7.BYTE |= 0x40;   /* Flag clear */
#endif /* USB_FUNCSEL_USBIP0_PP */
}
/******************************************************************************
End of function usb_cpu_usb_int_hand
******************************************************************************/


/******************************************************************************
Function Name   : usb_cpu_d0fifo_int_hand
Description     : D0FIFO interrupt Handler
Arguments       : none
Return value    : none
******************************************************************************/
void usb_cpu_d0fifo_int_hand(void)
{
/* Condition compilation by the difference of USB function */
#if USB_FUNCSEL_USBIP0_PP != USB_NOUSE_PP
    usb_cstd_DmaHandler();      /* Call interrupt routine */
#endif /* USB_FUNCSEL_USBIP0_PP */
}
/******************************************************************************
End of function usb_cpu_d0fifo_int_hand
******************************************************************************/


/******************************************************************************
Function Name   : usb_cpu_d1fifo_int_hand
Description     : D1FIFO interrupt Handler
Arguments       : none
Return value    : none
******************************************************************************/
void usb_cpu_d1fifo_int_hand(void)
{
    /* Please add the processing for the system. */
}
/******************************************************************************
End of function usb_cpu_d1fifo_int_hand
******************************************************************************/


/******************************************************************************
Function Name   : usb2_cpu_usb_int_hand
Description     : USB interrupt Handler
Arguments       : void
Return value    : void
******************************************************************************/
void usb2_cpu_usb_int_hand(void)
{
/* Condition compilation by the difference of USB function */
#if USB_FUNCSEL_USBIP1_PP != USB_NOUSE_PP
    usb2_cstd_UsbHandler();     /* Call interrupt routine */
#endif /* USB_FUNCSEL_USBIP1_PP */
}
/******************************************************************************
End of function usb2_cpu_usb_int_hand
******************************************************************************/


/******************************************************************************
Function Name   : usb2_cpu_d0fifo_int_hand
Description     : D0FIFO interrupt Handler
Arguments       : none
Return value    : none
******************************************************************************/
void usb2_cpu_d0fifo_int_hand(void)
{
/* Condition compilation by the difference of USB function */
#if USB_FUNCSEL_USBIP1_PP != USB_NOUSE_PP
    usb2_cstd_DmaHandler();     /* Call interrupt routine */
#endif /* USB_FUNCSEL_USBIP1_PP */
}
/******************************************************************************
End of function usb2_cpu_d0fifo_int_hand
******************************************************************************/


/******************************************************************************
Function Name   : usb2_cpu_d1fifo_int_hand
Description     : D1FIFO interrupt Handler
Arguments       : none
Return value    : none
******************************************************************************/
void usb2_cpu_d1fifo_int_hand(void)
{
    /* Please add the processing for the system. */
}
/******************************************************************************
End of function usb2_cpu_d1fifo_int_hand
******************************************************************************/


/******************************************************************************
Renesas Abstracted RSK functions
******************************************************************************/
/******************************************************************************
Function Name   : usb_cpu_int_enable
Description     : USB Interrupt Enable
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel. 
Return value    : void
******************************************************************************/
void usb_cpu_int_enable(USB_UTR_t *ptr)
{
    if( ptr->ip == USB_USBIP_0 )
    {
        /* Interrupt enable register (USB0 USBIO enable)
        b0 IEN0 Interrupt enable bit
        b1 IEN1 Interrupt enable bit
        b2 IEN2 Interrupt enable bit
        b3 IEN3 Interrupt enable bit
        b4 IEN4 Interrupt enable bit
        b5 IEN5 Interrupt enable bit
        b6 IEN6 Interrupt enable bit
        b7 IEN7 Interrupt enable bit
        */
        IEN( USB0, USBI0 )   = 1;                              /* Enable USB0 interrupt */
        IEN( USB0, D0FIFO0 ) = usb_gcstd_D0fifo[ptr->ip];
        IEN( USB0, D1FIFO0 ) = usb_gcstd_D1fifo[ptr->ip];
    }

    if( ptr->ip == USB_USBIP_1 )
    {
        /* Interrupt enable register (USB1 USBIO enable)
        b0 IEN0 Interrupt enable bit
        b1 IEN1 Interrupt enable bit
        b2 IEN2 Interrupt enable bit
        b3 IEN3 Interrupt enable bit
        b4 IEN4 Interrupt enable bit
        b5 IEN5 Interrupt enable bit
        b6 IEN6 Interrupt enable bit
        b7 IEN7 Interrupt enable bit
        */
        IEN( USBA, USBAR )   = 1u;                            /* Enable USBA interrupt */
        IEN( USBA, D0FIFO2 ) = usb_gcstd_D0fifo[ptr->ip];
        IEN( USBA, D1FIFO2 ) = usb_gcstd_D1fifo[ptr->ip];
    }
}
/******************************************************************************
End of function usb_cpu_int_enable
******************************************************************************/


