pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/rx_mcu.c
/******************************************************************************
Function Name   : usb_cpu_int_disable
Description     : USB Interrupt disable
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel. 
Return value    : void
******************************************************************************/
void usb_cpu_int_disable(USB_UTR_t *ptr)
{
    if( ptr->ip == USB_USBIP_0 )
    {
        /* Interrupt enable register (USB0 USBIO disable)
        b0 IEN0 Interrupt enable bit
        b1 IEN1 Interrupt enable bit
        b2 IEN2 Interrupt enable bit
        b3 IEN3 Interrupt enable bit
        b4 IEN4 Interrupt enable bit
        b5 IEN5 Interrupt enable bit
        b6 IEN6 Interrupt enable bit
        b7 IEN7 Interrupt enable bit
        */
        IEN( USB0, USBI0 ) = 0;    /* Disnable USB0 interrupt */
        usb_gcstd_D0fifo[ptr->ip] = IEN( USB0, D0FIFO0 );
        IEN( USB0, D0FIFO0 ) = 0;
        usb_gcstd_D1fifo[ptr->ip] = IEN( USB0, D1FIFO0 );
        IEN( USB0, D1FIFO0 ) = 0;
    }
    
    if ( ptr->ip == USB_USBIP_1 )
    {
        /* Interrupt enable register (USB1 USBIO disable)
        b0 IEN0 Interrupt enable bit
        b1 IEN1 Interrupt enable bit
        b2 IEN2 Interrupt enable bit
        b3 IEN3 Interrupt enable bit
        b4 IEN4 Interrupt enable bit
        b5 IEN5 Interrupt enable bit
        b6 IEN6 Interrupt enable bit
        b7 IEN7 Interrupt enable bit
        */
        IEN( USBA, USBAR ) = 0u;   /* Disnable USBA interrupt */
        usb_gcstd_D0fifo[ptr->ip] = IEN( USBA, D0FIFO2 );
        IEN( USBA, D0FIFO2 ) = 0;
        usb_gcstd_D1fifo[ptr->ip] = IEN( USBA, D1FIFO2 );
        IEN( USBA, D1FIFO2 ) = 0;
    }
}
/******************************************************************************
End of function usb_cpu_int_disable
******************************************************************************/


/******************************************************************************
TIMER function
******************************************************************************/
/******************************************************************************
Function Name   : usb_cpu_Delay1us
Description     : 1us Delay timer
Arguments       : uint16_t  time        ; Delay time(*1us)
Return value    : none
Note            : Please change for your MCU
******************************************************************************/
void usb_cpu_Delay1us(uint16_t time)
{
    volatile register uint16_t  i;

    /* Wait 1us (Please change for your MCU) */
#if defined(BSP_MCU_RX64M)
    for( i = 0; i < (9 * time); ++i )
#endif /* defined(BSP_MCU_RX64M) */

#if defined(BSP_MCU_RX71M)
    for( i = 0; i < (20 * time); ++i )
#endif /* defined(BSP_MCU_RX71M) */

    {
    };
}
/******************************************************************************
End of function usb_cpu_Delay1us
******************************************************************************/


/******************************************************************************
Function Name   : usb_cpu_DelayXms
Description     : xms Delay timer
Arguments       : uint16_t  time        ; Delay time(*1ms)
Return value    : void
Note            : Please change for your MCU
******************************************************************************/
void usb_cpu_DelayXms(uint16_t time)
{
    /* Wait xms (Please change for your MCU) */
    volatile register uint32_t  i;

    /* Wait 1ms */
#if defined(BSP_MCU_RX64M)
    for( i = 0; i < (9500 * time); ++i )
#endif /* defined(BSP_MCU_RX64M) */

#if defined(BSP_MCU_RX71M)
    for( i = 0; i < (20000 * time); ++i )
#endif /* defined(BSP_MCU_RX71M) */
    {
    };
        /* When "ICLK=120MHz" is set, this code is waiting for 1ms.
          Please change this code with CPU Clock mode. */
}
/******************************************************************************
End of function usb_cpu_DelayXms
******************************************************************************/


#ifdef USB_DTC_ENABLE
/******************************************************************************
Function Name   : usb_cpu_d0fifo2buf_start_dma
Description     : FIFO to Buffer data read DMA start
Arguments       : USB_UTR_t *ptr        : USB internal structure. Selects USB channel. 
                : uint32_t SourceAddr   : Source address
Return value    : void
******************************************************************************/
void usb_cpu_d0fifo2buf_start_dma(USB_UTR_t *ptr, uint32_t SourceAddr)
{
    uint16_t    size;
    uint32_t    tmp;
    dtc_activation_source_t    act_src;    /* activation source is Software Interrupt */


    /* DTC Transfer enable
    b0    DTCST    DTC module start bit
    b7-b1 Reserved 0
    */
    R_DTC_Control(DTC_CMD_DTC_START, NULL, 0);

    /* DTC control register (Transfer Information Read No Skip)
    b2-b0 Reserved 0
    b3    Reserved 0
    b4    RRS      DTC Transfer Information Read Skip enable bit
    b7-b5 Reserved 0
    */
    R_DTC_Control(DTC_CMD_DATA_READ_SKIP_DISABLE, NULL, 0);

    /* DTC mode register A (Block Transfer Set)
    b1-b0 Reserved 0
    b3-b2 SM       source address mode bit
    b5-b4 SZ       DTC data transfer size bit
    b7-b6 MD       DTC mode bit
    */
    usb_td_cfg[ptr->ip].transfer_mode = DTC_TRANSFER_MODE_BLOCK;

    if(ptr->ip == USB_USBIP_0)
    {
        act_src = DTCE_USB0_D0FIFO0;
        tmp = ((usb_gcstd_Dma0Fifo[ptr->ip] - 1) / 2) + 1;

        /* DTC mode register A (Word Size)
        b1-b0 Reserved 0
        b3-b2 SM       source address mode bit
        b5-b4 SZ       DTC data transfer size bit
        b7-b6 MD       DTC mode bit
        */
        usb_td_cfg[ptr->ip].data_size = DTC_DATA_SIZE_WORD;
    }
    else if(ptr->ip == USB_USBIP_1)
    {
        act_src = DTCE_USBA_D0FIFO2;
        tmp = ((usb_gcstd_Dma0Fifo[ptr->ip] - 1) / 4) + 1;

        /* DTC mode register A (Long Size)
        b1-b0 Reserved 0
        b3-b2 SM       source address mode bit
        b5-b4 SZ       DTC data transfer size bit
        b7-b6 MD       DTC mode bit
        */
        usb_td_cfg[ptr->ip].data_size = DTC_DATA_SIZE_LWORD;
    }

