pwbf/RX64M_ETHERNET/r_usb_basic/src/HW/comm/rx_mcu.c
/******************************************************************************
Function Name   : usb_cpu_d0fifo_restart_dma
Description     : DMA Restart
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel. 
Return value    : none
******************************************************************************/
void usb_cpu_d0fifo_restart_dma( USB_UTR_t *ptr )
{
    uint16_t    size;
    uint32_t    tmp;
    dtc_activation_source_t    act_src;    /* activation source is Software Interrupt */


    if(ptr->ip == USB_USBIP_0)
    {
        act_src = DTCE_USB0_D0FIFO0;

        if( (usb_gcstd_Dma0Size[ptr->ip] & 0x0001u) != 0u )
        {
            /* if count == odd */
            tmp = usb_gcstd_Dma0Size[ptr->ip];

            /* DTC mode register A (Byte Size)
            b1-b0 Reserved 0
            b3-b2 SM       source address mode bit
            b5-b4 SZ       DTC data transfer size bit
            b7-b6 MD       DTC mode bit
            */
            usb_td_cfg[ptr->ip].data_size = DTC_DATA_SIZE_BYTE;

            /* DTC source address register (Table address)
            b31-b0 SAR Source address
            */
            usb_td_cfg[ptr->ip].dest_addr = usb_cstd_GetD0fifo8Adr(ptr);
        }
        else
        {
            tmp = usb_gcstd_Dma0Size[ptr->ip] / 2;

            /* DTC mode register A (Word Size)
            b1-b0 Reserved 0
            b3-b2 SM       source address mode bit
            b5-b4 SZ       DTC data transfer size bit
            b7-b6 MD       DTC mode bit
            */
            usb_td_cfg[ptr->ip].data_size = DTC_DATA_SIZE_WORD;
        }
    }
    else if(ptr->ip == USB_USBIP_1)
    {
        act_src = DTCE_USBA_D0FIFO2;

        if( (usb_gcstd_Dma0Size[ptr->ip] & 0x0003u) != 0u )
        {
            /* if count == odd */
            tmp = usb_gcstd_Dma0Size[ptr->ip];

            /* DTC mode register A (Byte Size)
            b1-b0 Reserved 0
            b3-b2 SM       source address mode bit
            b5-b4 SZ       DTC data transfer size bit
            b7-b6 MD       DTC mode bit
            */
            usb_td_cfg[ptr->ip].data_size = DTC_DATA_SIZE_BYTE;

            /* DTC source address register (Table address)
            b31-b0 SAR Source address
            */
            usb_td_cfg[ptr->ip].dest_addr = usb_cstd_GetD0fifo8Adr(ptr);
        }
        else
        {
            tmp = usb_gcstd_Dma0Size[ptr->ip] / 4;

            /* DTC mode register A (Word Size)
            b1-b0 Reserved 0
            b3-b2 SM       source address mode bit
            b5-b4 SZ       DTC data transfer size bit
            b7-b6 MD       DTC mode bit
            */
            usb_td_cfg[ptr->ip].data_size = DTC_DATA_SIZE_LWORD;
        }
    }

    /* DTC source address register (Table address)
    b31-b0 SAR Destination address
    */
    usb_td_cfg[ptr->ip].source_addr = usb_dtc_transfer_data[ptr->ip].lw2;

    size = (uint8_t)(tmp);

    /* DTC transfer count registerA
    b15-b0 CRA Transfer count
    */
    usb_td_cfg[ptr->ip].block_size = (uint16_t)(size);

    /* DTC transfer count registerB (Block count)
    b15-b0 CRB Transfer count
    */
    usb_td_cfg[ptr->ip].transfer_count = (uint16_t)(1);
    
    if( ptr->ip == USB_USBIP_0 )
    {
        IEN( USB0, D0FIFO0 ) = 0;
        R_DTC_Create( act_src, &usb_dtc_transfer_data[ptr->ip], &usb_td_cfg[ptr->ip], 0 );
        IEN( USB0, D0FIFO0 ) = 1;
    }
    else
    {
        IEN( USBA, D0FIFO2 ) = 0;
        R_DTC_Create( act_src, &usb_dtc_transfer_data[ptr->ip], &usb_td_cfg[ptr->ip], 0 );
        IEN( USBA, D0FIFO2 ) = 1;
    }

    /* DTC Transfer enable
    b0    DTCST    DTC module start bit
    b7-b1 Reserved 0
    */
    R_DTC_Control( DTC_CMD_DTC_START, NULL, 0 );

    if( ptr->ip == USB_USBIP_0 )
    {
        /* DTC start enable register (USB0 D0FIFO transfer)
        b0    DTCE     DTC start enable bit
        b7-b1 Reserved 0
        */
        DTCE( USB0, D0FIFO0 ) = 1;
    }
    else
    {
        /* DTC start enable register (USBA D0FIFO transfer)
        b0    DTCE     DTC start enable bit
        b7-b1 Reserved 0
        */
        DTCE( USBA, D0FIFO2 ) = 1;
    }
}
/******************************************************************************
End of function
******************************************************************************/


/******************************************************************************
Function Name   : usb_cpu_d0fifo_enable_dma
Description     : DTC(D0FIFO) interrupt enable (Interrupt priority 5 set)
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel. 
Return value    : none
******************************************************************************/
void usb_cpu_d0fifo_enable_dma(USB_UTR_t *ptr)
{
    if( ptr->ip == USB_USBIP_0 )
    {
        /* Priority D0FIFO0 = 0(Disable)
        b3-b0 IPR      Interrupt priority
        b7-b4 Reserved 0
        */
        IPR( USB0, D0FIFO0 ) = 0x05;
    }
    else
    {
        /* Priority D0FIFO2 = 0(Disable)
        b3-b0 IPR      Interrupt priority
        b7-b4 Reserved 0
        */
        IPR( USBA, D0FIFO2 ) = 0x05;
    }
}
/******************************************************************************
End of function
******************************************************************************/


/******************************************************************************
Function Name   : usb_cpu_d0fifo_disable_dma
Description     : D0FIFO interrupt disable (Interrupt priority 0 set)
Arguments       : USB_UTR_t *ptr  : USB internal structure. Selects USB channel. 
Return value    : none
******************************************************************************/
void usb_cpu_d0fifo_disable_dma(USB_UTR_t *ptr)
{
    if( ptr->ip == USB_USBIP_0 )
    {
        /* Priority D0FIFO0 = 0(Disable)
        b3-b0 IPR      Interrupt priority
        b7-b4 Reserved 0
        */
        IPR( USB0, D0FIFO0 ) = 0x00;
    }
    else
    {
        /* Priority D0FIFO2 = 0(Disable)
        b3-b0 IPR      Interrupt priority
        b7-b4 Reserved 0
        */
        IPR( USBA, D0FIFO2 ) = 0x00;
    }
}
/******************************************************************************
End of function
******************************************************************************/


/******************************************************************************
Function Name   : usb_cpu_get_dtc_block_count
Description     : Get DTC Transfer count reg B(CRB).
Arguments       : USB_UTR_t *ptr        : USB internal structure. Selects USB channel. 
Return value    : DTC Transfer count reg B(CRB)
******************************************************************************/
uint16_t usb_cpu_get_dtc_block_count(USB_UTR_t *ptr)
{
    uint16_t value;
    uint16_t status_reg = 0;
    
    /* Wait Complete DTC Transfer */
    do
    {
        status_reg = DTC.DTCSTS.WORD;
    }
    while( 0 != ( status_reg & 0x8000 ) );  /* DTC is not active */
 
    /* Read DTC transfer count (CRB) */
    value = (uint16_t)(usb_dtc_transfer_data[ptr->ip].lw4 & 0xffff);
    
    return value;
}
/******************************************************************************
End of function
******************************************************************************/
#endif /* USB_DTC_ENABLE */


/******************************************************************************
End  Of File
******************************************************************************/
